cases/heatedCavity/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 300;

boundaryField
{
    hotWall
    {
        type            fixedValue;
        value           uniform 315;
    }

    coldWall
    {
        type            fixedValue;
        value           uniform 285;
    }

    adiabaticWalls
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

