cases/heatedCavity/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 1e-05;

rhoRef          [1 -3 0 0 0 0 0] 1.0;
beta            [0 0 0 -1 0 0 0] 3e-03;   // Thermal expansion coefficient
TRef            [0 0 0 1 0 0 0] 300;
g               [0 1 -2 0 0 0 0] (0 -9.81 0);

