cases/heatedCavity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | microClimateFoam tutorial                       |
|  \\    /   O peration     | Heated cavity validation case                   |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     microClimateFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         200;

deltaT          0.5;
writeControl    timeStep;
writeInterval   20;

purgeWrite      2;

writeFormat     ascii;
writePrecision  7;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable yes;

